---
kind: property
id: P:Autodesk.Revit.DB.Architecture.BuildingPad.AssociatedTopographySurfaceId
source: html/7c972f93-c6c8-dd93-3bb0-6bf5aae67d30.htm
---
# Autodesk.Revit.DB.Architecture.BuildingPad.AssociatedTopographySurfaceId Property

The element id of a topography surface created by the introduction of this building pad.

## Syntax (C#)
```csharp
public ElementId AssociatedTopographySurfaceId { get; }
```